[
  {
    "name": "credential_id",
    "type": "STRING",
    "mode": "REQUIRED",
    "description": "Unique identifier (UUID) for this cloud credential record. Used as primary key for credential management operations (rotation, updates, deletion). Each stored credential gets a unique ID for lifecycle tracking."
  },
  {
    "name": "provider",
    "type": "STRING",
    "mode": "REQUIRED",
    "description": "Cloud provider identifier. Valid values: 'gcp' (Google Cloud Platform), 'aws' (Amazon Web Services), 'azure' (Microsoft Azure), 'openai', 'anthropic', etc. Used for routing authentication to the correct provider SDK and validation logic."
  },
  {
    "name": "credential_type",
    "type": "STRING",
    "mode": "REQUIRED",
    "description": "Type of credential being stored. Examples: 'service_account_key' (GCP JSON key), 'access_key' (AWS access/secret key pair), 'api_key' (API tokens), 'oauth_token', 'connection_string'. Used to determine decryption and usage logic for different authentication methods."
  },
  {
    "name": "encrypted_value",
    "type": "BYTES",
    "mode": "REQUIRED",
    "description": "AES-256 encrypted credential data stored as binary bytes. Contains the actual sensitive credential (service account JSON, API key, access tokens, etc.) encrypted using Cloud KMS or application-level encryption. Never store credentials in plaintext. Decrypted only when needed for API calls."
  },
  {
    "name": "created_at",
    "type": "TIMESTAMP",
    "mode": "REQUIRED",
    "description": "UTC timestamp when this credential was first stored. Used for audit trails, credential rotation policies, and identifying old credentials that should be rotated. Immutable after creation."
  },
  {
    "name": "updated_at",
    "type": "TIMESTAMP",
    "mode": "REQUIRED",
    "description": "UTC timestamp when this credential was last updated (rotation, re-encryption, metadata changes). Initially same as created_at. Updated on each modification. Used for tracking credential freshness and rotation compliance."
  },
  {
    "name": "is_active",
    "type": "BOOLEAN",
    "mode": "REQUIRED",
    "description": "Whether this credential is currently active and should be used for authentication. FALSE means credential is disabled/revoked. Used for immediate credential disabling without deletion (maintains audit trail). Can be toggled for emergency credential rotation or temporary access suspension. Default: TRUE for new credentials."
  }
]
